

&НаКлиенте
Процедура ВстречиСКонкретнымКондидатом(Команда)
    ОчиститьСообщения();
    ВстречиСКонкретнымКондидатомНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВстречиСКонкретнымКондидатомНаСервере()

    // найдём все документы поступления еды
    // от поставщика ООО "Поле"
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   Ссылка,
        |   Кандидат
        |ИЗ
        |   Документ.ВстречиСКандидатами КАК ВстречиСКандидатами
        |ГДЕ
        |   Кандидат = &ВыбКандидат
        |УПОРЯДОЧИТЬ ПО
        |   Дата ВОЗР";

    Запрос.УстановитьПараметр(
        "ВыбКандидат",
		Справочники.РегистрацияКандидатов.НайтиПоНаименованию("Абрамов")
    );

    РезультатЗапроса = Запрос.Выполнить();

    ВыборкаДокументов = РезультатЗапроса.Выбрать();

    Пока ВыборкаДокументов.Следующий() Цикл        
        Сообщить(
            Строка(ВыборкаДокументов.Ссылка) + " " + 
            ВыборкаДокументов.Кандидат
        );
    КонецЦикла;

КонецПроцедуры

