
&НаКлиенте
Процедура ДобавитьКартинку(Команда)
	
ИмяФайла = "";
ПутьФайла = "";

Если ПоместитьФайл(ПутьФайла, , ИмяФайла, Истина) = Истина Тогда
Фото = ПутьФайла;
УстановитьКартинку();
КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура УстановитьКартинку()

НовыйФайлКартинки = Справочники.Файлы.СоздатьЭлемент();
НовыйФайлКартинки.Файл = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Фото));
Фото = ПоместитьВоВременноеХранилище(НовыйФайлКартинки.Файл.Получить());
НовыйФайлКартинки.Записать();
Объект.Фотография = НовыйФайлКартинки.Ссылка;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
Фото = ПолучитьНавигационнуюСсылку(Объект.Фотография, "Файл");
Элементы.Фото.РазмерКартинки = РазмерКартинки.АвтоРазмер;

КонецПроцедуры



