
Процедура ЗаполнитьЭлементыПланировщика()
	
	ЭлементыПланировщика = Планировщик.Элементы;
    ЭлементыПланировщика.Очистить();
	
	              	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВстречиСКандидатами.Дата КАК Дата,
		|	ВстречиСКандидатами.Кандидат,
		|	ВстречиСКандидатами.Вакансия
		|ИЗ
		|	Документ.ВстречиСКандидатами КАК ВстречиСКандидатами
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для каждого подстрока Из РезультатЗапроса Цикл
		
		НовыйЭлемент = ЭлементыПланировщика.Добавить(подстрока.Дата, подстрока.Дата);
		
		НовыйЭлемент.Текст = подстрока.Ссылка;
		НовыйЭлемент.ЦветФона = WebЦвета.ЗеленаяЛужайка;	
		НовыйЭлемент.Картинка = БиблиотекаКартинок.Ресурс;
		НовыйЭлемент.Значение = подстрока.Ссылка;
		
		КонецЦикла;
	
КонецПроцедуры